# Создайте иерархию классов, которая описывает машины.
# Есть базовый класс Car.
#  Также есть два класса - PassengerCar и Truck,
#  которые наследуются от Car.
# В классах наследниках определить методы количества пассажиров и грузоподъемность авто соотвественно для класса
# PassengerCar и Truck
# Вывести класс Pickup который будет наследоваться от классов PassengerCar и Truck
# и определять одновременно и количесво пассажаиров и грузоподъемность.
# Проверить передачу параметров из конструктора класса Pickup в конструкторы классов предков
