# Создайте два класса: один с использованием __slots__, а другой без его использования.
# Напишите методы для добавления, удаления и изменения атрибутов в обоих классах. Сравните использование памяти
# и поведение __dict__ в каждом случае.
#
# Шаги:
# Создайте класс ClassWithDict, который не использует __slots__, и реализуйте методы для добавления,
# удаления и изменения атрибутов.
# Создайте класс ClassWithSlots, который использует __slots__, и реализуйте аналогичные методы.
# Напишите код для создания экземпляров каждого класса, добавления, удаления и изменения атрибутов.
# Сравните использование памяти каждым классом.
# Попробуйте получить доступ к __dict__ в обоих классах и объясните результаты.
