# Загрузите текст из файла regex-1.txt
# Найти первое слово строки.
# Найти последнее слово строки.
# Найти все знаки препинания.
# Найти последнее слово строки без завершающего символа знака препинания.
# Найдите все номера кредитных карт в тексте. Номер кредитной карты — это 16-значное число, разделенное пробелами или
# дефисами каждые 4 цифры, но не 16 цифр подряд без разделителей.
# Прочитайте из текста даты формата dd/mm/yyyy или dd-mm-yyyy и разделите их на день, месяц и год

import re


def main():
    pass


if __name__ == '__main__':
    main()
