# Создайте класс BankAccount, который будет представлять банковский счет. Класс должен включать следующие функции:
#
# Инкапсуляция: Приватные атрибуты для номера счета и баланса.
# Конструктор: Метод для инициализации объекта с номером счета и начальным балансом.
# Геттеры и сеттеры: Методы для доступа и изменения баланса.
# Магические методы: Методы для добавления и снятия денег (__add__ и __sub__),
# сравнения балансов (__eq__, __lt__, __le__, и т.д.), строкового представления (__str__ и __repr__),
# и вызова объекта (__call__).

