# Через библиотеку requests выполнить GET запрос к корневому адресу.
# Выполнить GET запрос к серверу – получить список заданий.
# Выполнить POST запрос к серверу – добавить в список два задания (разных).
# Выполнить GET запрос к серверу – получить задание с номером 2.
# Выполнить GET запрос к серверу – получить список заданий.
# Выполнить PUT запрос к серверу – изменить одно из заданий.
# Выполнить GET запрос к серверу – получить список заданий.

# Смотрите на документацию к API по адресу http://127.0.0.1:8085/docs

def main():
    # your code here
    pass


if __name__ == '__main__':
    main()
