# Выполнить GET запрос к серверу – получить список заданий.
# Выполнить DELETE запрос к серверу – удалить одно задание.
# Выполнить GET запрос к серверу – получить список заданий.
# Выполнить DELETE запрос к серверу – удалить все задания.
# Выполнить GET запрос к серверу – получить список заданий.

# Смотрите на документацию к API по адресу http://127.0.0.1:8085/docs


import requests


def main():
    root_address = 'http://127.0.0.1:8085'
    # your code here


if __name__ == '__main__':
    main()
