# Задача:
#
# Реализуйте паттерн Adapter, чтобы объединить интерфейс нового API системы с устаревшим API.
# Допустим, у вас есть старая система для расчета площади и периметра прямоугольника, и
# вы хотите использовать новую систему, которая использует методы с другими именами и
# принимает данные в другом формате.
#
# Шаги:
# Создайте старую систему с методами для расчета площади и периметра прямоугольника.
# Создайте новую систему с методами, которые используют другой интерфейс.
# Реализуйте адаптер, который преобразует вызовы от старой системы к новой системе.

